cmsis-svd/cmsis-svd/data/Spansion/MB9BF16xx.svd
        <!-- REGISTER "TTCR1" -->
        <register>
          <name>TTCR1</name>
          <description> register TTCR1 </description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRG7O" -->
            <field>
              <name>TRG7O</name>
              <description> bitfield TRG7O </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG5O" -->
            <field>
              <name>TRG5O</name>
              <description> bitfield TRG5O </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG3O" -->
            <field>
              <name>TRG3O</name>
              <description> bitfield TRG3O </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG1O" -->
            <field>
              <name>TRG1O</name>
              <description> bitfield TRG1O </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1" -->
            <field>
              <name>CS1</name>
              <description> bitfield CS1 </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MONI1" -->
            <field>
              <name>MONI1</name>
              <description> bitfield MONI1 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STR1" -->
            <field>
              <name>STR1</name>
              <description> bitfield STR1 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TTCR2" -->
        <register>
          <name>TTCR2</name>
          <description> register TTCR2 </description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRG22O" -->
            <field>
              <name>TRG22O</name>
              <description> bitfield TRG22O </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG20O" -->
            <field>
              <name>TRG20O</name>
              <description> bitfield TRG20O </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG18O" -->
            <field>
              <name>TRG18O</name>
              <description> bitfield TRG18O </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG16O" -->
            <field>
              <name>TRG16O</name>
              <description> bitfield TRG16O </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS2" -->
            <field>
              <name>CS2</name>
              <description> bitfield CS2 </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MONI2" -->
            <field>
              <name>MONI2</name>
              <description> bitfield MONI2 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STR2" -->
            <field>
              <name>STR2</name>
              <description> bitfield STR2 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "COMP0" -->
        <register>
          <name>COMP0</name>
          <description> register COMP0 </description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
        </register>
        <!-- REGISTER "COMP2" -->
        <register>
          <name>COMP2</name>
          <description> register COMP2 </description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "COMP4" -->
        <register derivedFrom="COMP0">
          <name>COMP4</name>
          <description> register COMP4 </description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "COMP6" -->
        <register derivedFrom="COMP2">
          <name>COMP6</name>
          <description> register COMP6 </description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "COMP1" -->
        <register derivedFrom="COMP0">
          <name>COMP1</name>
          <description> register COMP1 </description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "COMP3" -->
        <register derivedFrom="COMP2">
          <name>COMP3</name>
          <description> register COMP3 </description>
          <addressOffset>0x2C</addressOffset>
        </register>
