cmsis-svd/cmsis-svd/data/Spansion/MB9BF16xx.svd
        <!-- REGISTER "RT_TMR" -->
        <register>
          <name>RT_TMR</name>
          <description> register RT_TMR </description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "PWC_TMCR" -->
        <register>
          <name>PWC_TMCR</name>
          <description> register PWC_TMCR </description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x77F6</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS2_0" -->
            <field>
              <name>CKS2_0</name>
              <description> bitfield CKS2_0 </description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description> bitfield EGS </description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "T32" -->
            <field>
              <name>T32</name>
              <description> bitfield T32 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description> bitfield FMD </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description> bitfield MDSE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description> bitfield CTEN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_TMCR2" -->
        <register>
          <name>PWC_TMCR2</name>
          <description> register PWC_TMCR2 </description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description> bitfield CKS3 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_STC" -->
        <register>
          <name>PWC_STC</name>
          <description> register PWC_STC </description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xD5</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERR" -->
            <field>
              <name>ERR</name>
              <description> bitfield ERR </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EDIE" -->
            <field>
              <name>EDIE</name>
              <description> bitfield EDIE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVIE" -->
            <field>
              <name>OVIE</name>
              <description> bitfield OVIE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDIR" -->
            <field>
              <name>EDIR</name>
              <description> bitfield EDIR </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OVIR" -->
            <field>
              <name>OVIR</name>
              <description> bitfield OVIR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_DTBF" -->
        <register>
          <name>PWC_DTBF</name>
          <description> register PWC_DTBF </description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BT1" -->
    <peripheral derivedFrom="BT0">
      <name>BT1</name>
      <baseAddress>0x40025040</baseAddress>
      <!-- INTERRUPT "BT1" -->
      <interrupt>
        <name>BT1</name>
        <value>40</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT2" -->
    <peripheral derivedFrom="BT0">
      <name>BT2</name>
      <baseAddress>0x40025080</baseAddress>
      <!-- INTERRUPT "BT2" -->
      <interrupt>
        <name>BT2</name>
        <value>41</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT3" -->
    <peripheral derivedFrom="BT0">
      <name>BT3</name>
      <baseAddress>0x400250C0</baseAddress>
      <!-- INTERRUPT "BT3" -->
      <interrupt>
        <name>BT3</name>
        <value>42</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT4" -->
    <peripheral derivedFrom="BT0">
      <name>BT4</name>
      <baseAddress>0x40025200</baseAddress>
      <!-- INTERRUPT "BT4" -->
      <interrupt>
        <name>BT4</name>
        <value>43</value>
      </interrupt>
    </peripheral>
