cmsis-svd/cmsis-svd/data/Spansion/MB9BF16xx.svd
        <!-- REGISTER "QPCRR" -->
        <register>
          <name>QPCRR</name>
          <description> register QPCRR </description>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC1" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC1</name>
      <baseAddress>0x40026040</baseAddress>
      <!-- INTERRUPT "QPRC1" -->
      <interrupt>
        <name>QPRC1</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC2" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC2</name>
      <baseAddress>0x40026080</baseAddress>
      <!-- INTERRUPT "QPRC2" -->
      <interrupt>
        <name>QPRC2</name>
        <value>96</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC3" -->
    <peripheral derivedFrom="QPRC0">
      <name>QPRC3</name>
      <baseAddress>0x400260C0</baseAddress>
      <!-- INTERRUPT "QPRC3" -->
      <interrupt>
        <name>QPRC3</name>
        <value>97</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "QPRC0_NF" -->
    <peripheral>
      <name>QPRC0_NF</name>
      <description> peripheral QPRC0_NF </description>
      <groupName>QPRC0_NF</groupName>
      <baseAddress>0x40026100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "NFCTLA" -->
        <register>
          <name>NFCTLA</name>
          <description> register NFCTLA </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AINMD" -->
            <field>
              <name>AINMD</name>
              <description> bitfield AINMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AINLV" -->
            <field>
              <name>AINLV</name>
              <description> bitfield AINLV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AINNWS" -->
            <field>
              <name>AINNWS</name>
              <description> bitfield AINNWS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NFCTLB" -->
        <register>
          <name>NFCTLB</name>
          <description> register NFCTLB </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BINMD" -->
            <field>
              <name>BINMD</name>
              <description> bitfield BINMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BINLV" -->
            <field>
              <name>BINLV</name>
              <description> bitfield BINLV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BINNWS" -->
            <field>
              <name>BINNWS</name>
              <description> bitfield BINNWS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NFCTLZ" -->
        <register>
          <name>NFCTLZ</name>
          <description> register NFCTLZ </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZINMD" -->
            <field>
              <name>ZINMD</name>
              <description> bitfield ZINMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ZINLV" -->
            <field>
              <name>ZINLV</name>
              <description> bitfield ZINLV </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ZINNWS" -->
            <field>
              <name>ZINNWS</name>
              <description> bitfield ZINNWS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC1_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC1_NF</name>
      <baseAddress>0x40026110</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "QPRC2_NF" -->
    <peripheral derivedFrom="QPRC0_NF">
      <name>QPRC2_NF</name>
      <baseAddress>0x40026120</baseAddress>
    </peripheral>
