cmsis-svd/cmsis-svd/data/Spansion/MB9BF16xx.svd
        <!-- REGISTER "CCB" -->
        <register>
          <name>CCB</name>
          <description> register CCB </description>
          <addressOffset>0x180</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "TRIM" -->
        <register>
          <name>TRIM</name>
          <description> register TRIM </description>
          <addressOffset>0x184</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BOOST" -->
        <register>
          <name>BOOST</name>
          <description> register BOOST </description>
          <addressOffset>0x188</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BOOST" -->
            <field>
              <name>BOOST</name>
              <description> bitfield BOOST </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EWKUP" -->
        <register>
          <name>EWKUP</name>
          <description> register EWKUP </description>
          <addressOffset>0x18C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUP0" -->
            <field>
              <name>WUP0</name>
              <description> bitfield WUP0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VDET" -->
        <register>
          <name>VDET</name>
          <description> register VDET </description>
          <addressOffset>0x190</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PON" -->
            <field>
              <name>PON</name>
              <description> bitfield PON </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDET" -->
        <register>
          <name>FDET</name>
          <description> register FDET </description>
          <addressOffset>0x194</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x80</resetMask>
        </register>
        <!-- REGISTER "HIBRST" -->
        <register>
          <name>HIBRST</name>
          <description> register HIBRST </description>
          <addressOffset>0x198</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HIBRST" -->
            <field>
              <name>HIBRST</name>
              <description> bitfield HIBRST </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPFR" -->
        <register>
          <name>VBPFR</name>
          <description> register VBPFR </description>
          <addressOffset>0x19C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SPSR1" -->
            <field>
              <name>SPSR1</name>
              <description> bitfield SPSR1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPSR0" -->
            <field>
              <name>SPSR0</name>
              <description> bitfield SPSR0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR3" -->
            <field>
              <name>VPFR3</name>
              <description> bitfield VPFR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR2" -->
            <field>
              <name>VPFR2</name>
              <description> bitfield VPFR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR1" -->
            <field>
              <name>VPFR1</name>
              <description> bitfield VPFR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR0" -->
            <field>
              <name>VPFR0</name>
              <description> bitfield VPFR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPCR" -->
        <register>
          <name>VBPCR</name>
          <description> register VBPCR </description>
          <addressOffset>0x1A0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPCR3" -->
            <field>
              <name>VPCR3</name>
              <description> bitfield VPCR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR2" -->
            <field>
              <name>VPCR2</name>
              <description> bitfield VPCR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR1" -->
            <field>
              <name>VPCR1</name>
              <description> bitfield VPCR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR0" -->
            <field>
              <name>VPCR0</name>
              <description> bitfield VPCR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDDR" -->
        <register>
          <name>VBDDR</name>
          <description> register VBDDR </description>
          <addressOffset>0x1A4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDDR3" -->
            <field>
              <name>VDDR3</name>
              <description> bitfield VDDR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR2" -->
            <field>
              <name>VDDR2</name>
              <description> bitfield VDDR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR1" -->
            <field>
              <name>VDDR1</name>
              <description> bitfield VDDR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR0" -->
            <field>
              <name>VDDR0</name>
              <description> bitfield VDDR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDIR" -->
        <register>
          <name>VBDIR</name>
          <description> register VBDIR </description>
          <addressOffset>0x1A8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDIR3" -->
            <field>
              <name>VDIR3</name>
              <description> bitfield VDIR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR2" -->
            <field>
              <name>VDIR2</name>
              <description> bitfield VDIR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR1" -->
            <field>
              <name>VDIR1</name>
              <description> bitfield VDIR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR0" -->
            <field>
              <name>VDIR0</name>
              <description> bitfield VDIR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDOR" -->
        <register>
          <name>VBDOR</name>
          <description> register VBDOR </description>
          <addressOffset>0x1AC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0F</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDOR3" -->
            <field>
              <name>VDOR3</name>
              <description> bitfield VDOR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR2" -->
            <field>
              <name>VDOR2</name>
              <description> bitfield VDOR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR1" -->
            <field>
              <name>VDOR1</name>
              <description> bitfield VDOR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR0" -->
            <field>
              <name>VDOR0</name>
              <description> bitfield VDOR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPZR" -->
        <register>
          <name>VBPZR</name>
          <description> register VBPZR </description>
          <addressOffset>0x1B0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPZR1" -->
            <field>
              <name>VPZR1</name>
              <description> bitfield VPZR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPZR0" -->
            <field>
              <name>VPZR0</name>
              <description> bitfield VPZR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BREG00" -->
        <register>
          <name>BREG00</name>
          <description> register BREG00 </description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
