cmsis-svd/cmsis-svd/data/Spansion/MB9BF16xx.svd
        <!-- REGISTER "DREQENB7" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB7</name>
          <description> register DREQENB7 </description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "HWINT0" -->
        <register>
          <name>HWINT0</name>
          <description> register HWINT0 </description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "HWINT1" -->
        <register derivedFrom="HWINT0">
          <name>HWINT1</name>
          <description> register HWINT1 </description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "HWINT2" -->
        <register derivedFrom="HWINT0">
          <name>HWINT2</name>
          <description> register HWINT2 </description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "HWINT3" -->
        <register derivedFrom="HWINT0">
          <name>HWINT3</name>
          <description> register HWINT3 </description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "HWINT4" -->
        <register derivedFrom="HWINT0">
          <name>HWINT4</name>
          <description> register HWINT4 </description>
          <addressOffset>0x40</addressOffset>
        </register>
        <!-- REGISTER "HWINT5" -->
        <register derivedFrom="HWINT0">
          <name>HWINT5</name>
          <description> register HWINT5 </description>
          <addressOffset>0x44</addressOffset>
        </register>
        <!-- REGISTER "HWINT6" -->
        <register derivedFrom="HWINT0">
          <name>HWINT6</name>
          <description> register HWINT6 </description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "HWINT7" -->
        <register derivedFrom="HWINT0">
          <name>HWINT7</name>
          <description> register HWINT7 </description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK0" -->
        <register>
          <name>DQMSK0</name>
          <description> register DQMSK0 </description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSK1" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK1</name>
          <description> register DQMSK1 </description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "DQMSK2" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK2</name>
          <description> register DQMSK2 </description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "DQMSK3" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK3</name>
          <description> register DQMSK3 </description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK4" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK4</name>
          <description> register DQMSK4 </description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "DQMSK5" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK5</name>
          <description> register DQMSK5 </description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "DQMSK6" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK6</name>
          <description> register DQMSK6 </description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "DQMSK7" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK7</name>
          <description> register DQMSK7 </description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR0" -->
        <register>
          <name>DQMSKCLR0</name>
          <description> register DQMSKCLR0 </description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSKCLR1" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR1</name>
          <description> register DQMSKCLR1 </description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR2" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR2</name>
          <description> register DQMSKCLR2 </description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR3" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR3</name>
          <description> register DQMSKCLR3 </description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR4" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR4</name>
          <description> register DQMSKCLR4 </description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR5" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR5</name>
          <description> register DQMSKCLR5 </description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR6" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR6</name>
          <description> register DQMSKCLR6 </description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR7" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR7</name>
          <description> register DQMSKCLR7 </description>
          <addressOffset>0xAC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SDIF" -->
    <peripheral>
      <name>SDIF</name>
      <description> peripheral SDIF </description>
      <groupName>SDIF</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "SD" -->
      <interrupt>
        <name>SD</name>
        <value>118</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DUMMY" -->
        <register>
          <name>DUMMY</name>
          <description> register DUMMY </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>